/*
程序員(英文Programmer)是從事程序開發、維護的專業人員。
一般將程序員分為程序設計人員和程序編碼人員，但兩者的界限並不非常清楚，
特別是在中國。軟件從業人員分為初級程序員、高級程序員、系統分析員和項目經理四大類。

分詞結果:
[程序員, (, 英文, programmer, ), 是, 從事, 程序, 
開發, 、, 維護, 的, 專業, 人員, 。, 一般, 將, 
程序員, 分為, 程序, 設計, 人員, 和, 程序, 編碼, 
人員, ，, 但, 兩者, 的, 界限, 並, 不, 非常, 
清楚, ，, 特別, 是, 在, 中國, 。, 軟件, 從業,
 人員, 分為, 初級, 程序員, 、, 高級, 程序員, 、, 
 系統, 分析員, 和, 項目, 經理, 四, 大, 類, 。]

 去標點符號及常用字詞。

 得序列：
 [程序員, 英文, 程序, 開發, 維護, 專業, 人員, 程序員, 
 分為, 程序, 設計, 人員, 程序, 編碼, 人員, 界限, 特別,
  中國, 軟件, 人員, 分為, 程序員, 高級, 程序員, 系統, 
  分析員, 項目, 經理]

設window size 為5 ，每個詞左右4個詞為相鄰詞，建立相鄰詞陣列

*/


module.exports={"開發":["專業","程序員","維護","英文","程序","人員"],
"軟件":["程序員","分為","界限","高級","中國","特別","人員"],
"程序員":["開發","軟件","分析員","維護","系統","項目","經理","分為","英文","程序","專業","設計","高級","人員","中國"],
"分析員":["程序員","系統","項目","經理","高級"],
"維護":["專業","開發","程序員","分為","英文","程序","人員"],
"系統":["程序員","分析員","項目","經理","分為","高級"],
"項目":["程序員","分析員","系統","經理","高級"],
"經理":["程序員","分析員","系統","項目"],
"分為":["專業","軟件","設計","程序員","維護","系統","高級","程序","中國","特別","人員"],
"英文":["專業","開發","程序員","維護","程序"],
"程序":["專業","開發","設計","程序員","編碼","維護","界限","分為","英文","特別","人員"],
"特別":["軟件","編碼","分為","界限","程序","中國","人員"],
"專業":["開發","程序員","維護","分為","英文","程序","人員"],
"設計":["程序員","編碼","分為","程序","人員"],
"編碼":["設計","界限","程序","中國","特別","人員"],
"界限":["軟件","編碼","程序","中國","特別","人員"],
"高級":["程序員","軟件","分析員","系統","項目","分為","人員"],
"中國":["程序員","軟件","編碼","分為","界限","特別","人員"],
"人員":["開發","程序員","軟件","維護","分為","程序","特別","專業","設計","編碼","界限","高級","中國"]
}